Dlubal.RFEM5.SpringDefinitionType
Self-weight type

Dlubal.RFEM5.SpringDefinitionType.UnknownDefinitionType
Unknown spring definition type

Dlubal.RFEM5.SpringDefinitionType.ParametersDefinition
Definition by parameters

Dlubal.RFEM5.SpringDefinitionType.DiagramDefinition
Definition by diagram